# Используем JDK как базовый образ нашего контейнера
FROM openjdk:17-jdk-slim-buster

# Создаем рабочую директорию
WORKDIR /app
# Копируем jar файл с нашим приложением в созданную жиректорию app и укажем более короткое название
COPY build/libs/rest_api_aws_s3-1.0.1.jar /app/aws_s3.jar
#Указываем порт, на котором будет работать наше приложение
EXPOSE 8080

#Пишем команду для запуска нашей программы в терминале нашего образа
#Название файла пишем без app т.к. app это корневая папка и в ней мы и будем все искать
ENTRYPOINT ["java", "-jar", "aws_s3.jar"]